<policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <displayName />
  <description />
  <resources><stringTable><string id="Cat_VMwareDEM">VMware DEM</string></stringTable></resources>
</policyDefinitionResources>